app/controllers/participants_controller.rb

SELECT `participants`.* FROM `participants`
---
	def index
		@participants = Participant.all

INSERT INTO `participants` (`first_name`, `last_name`, `age`, `major`, `phone`, `email`, `university`, `first_question`, `second_question`, `third_question`, `fourth_question`, `fifth_question`, `sixth_question`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@participant = Participant.create(participant_params)

SELECT  `participants`.* FROM `participants` WHERE `participants`.`id` = ? LIMIT 1  [["id", 0]]
---
	def set_participant
		@participant = Participant.find(params[:id])